#include <stdio.h>
void QualityInChar()
{
	// وظيفة الفانكشن دي انها تجيب سطور الكواليتي وتحطها في فايل مستقل وهي في صورة كراكتر بدون ما تحولها
    int i = 0;	
	// بفتح الفايل الخاص بالفاست كيو عشان اقرا منه سطور الكواليتي 
	FILE* fpRead = fopen("FastQ File.fastq", "r");
	// بفتح الفايل اللي هكتب فيه سطور الكواليتي وهي في صوره كراكتر (الفايل الوسيط)
    FILE *fpWrite=fopen("QualityChar.txt","w");  
	//بتأكد لو الفايل مش بيفتح فهترجع 0 وهخليه يطبعلي الرساله دي للتاكيد
	if (!fpRead) {
		printf("Unable to open/detect file");
		return;
	}
    if (!fpWrite) {
		printf("Unable to open/detect file");
		return;
	}

// دي جزئية القرايه من الفايل حيث عملت متغير تشيك واديته قيمه 1 يعني هيبدا باول سطر في الفاست كيو 
	int check = 1;
	// بفرر ده ارراي من الكراكتر هخزن فيه سطر سطر من اللي هقراهم واديته حجم ب 100 باعتبار ان مفيش سطر فيهم زاد عن كده في الحجم 
	char buf[10000];

	//بتلف اللوب دي على فايل الفاست كيو سطر سطر 
	while (fgets(buf, 10000, fpRead)) {
    // بتأكد لو السطر كان السطر بتاع الكواليتي هيكتبه في الفايل الوسيط 
		if (!(check % 4))
		{
           fputs(buf,fpWrite); 
		}
		check+=1;
	}
    // لازم في الاخر اقفل الفايلات اللي فتحتها
	fclose(fpRead);
    fclose(fpWrite);  
	return;
}
void Reads()
{
	// وظيفة الفانكشن دي انها تجيب سطور الكواليتي وتحطها في فايل مستقل وهي في صورة كراكتر بدون ما تحولها
    int i = 0;	
	// بفتح الفايل الخاص بالفاست كيو عشان اقرا منه سطور الكواليتي 
	FILE* fpRead = fopen("FastQ File2.fastq", "r");
	// بفتح الفايل اللي هكتب فيه سطور الكواليتي وهي في صوره كراكتر (الفايل الوسيط)
    FILE *fpWrite=fopen("Reads.txt","w");  
	//بتأكد لو الفايل مش بيفتح فهترجع 0 وهخليه يطبعلي الرساله دي للتاكيد
	if (!fpRead) {
		printf("Unable to open/detect file");
		return;
	}
    if (!fpWrite) {
		printf("Unable to open/detect file");
		return;
	}

// دي جزئية القرايه من الفايل حيث عملت متغير تشيك واديته قيمه 1 يعني هيبدا باول سطر في الفاست كيو 
	int check = 1;
	// بفرر ده ارراي من الكراكتر هخزن فيه سطر سطر من اللي هقراهم واديته حجم ب 100 باعتبار ان مفيش سطر فيهم زاد عن كده في الحجم 
	char buf[10000];

	//بتلف اللوب دي على فايل الفاست كيو سطر سطر 
	while (fgets(buf, 10000, fpRead)) {
    // بتأكد لو السطر كان السطر بتاع الكواليتي هيكتبه في الفايل الوسيط 
		if (!(check % 2))
		{
			if(check %4!=0)
			{
				fputs(buf,fpWrite);
			}
			
		}
		check+=1;
	}
    // لازم في الاخر اقفل الفايلات اللي فتحتها
	fclose(fpRead);
    fclose(fpWrite);  
	return;
}
void IDs()
{
	// وظيفة الفانكشن دي انها تجيب سطور الكواليتي وتحطها في فايل مستقل وهي في صورة كراكتر بدون ما تحولها
    int i = 0;	
	// بفتح الفايل الخاص بالفاست كيو عشان اقرا منه سطور الكواليتي 
	FILE* fpRead = fopen("FastQ File2.fastq", "r");
	// بفتح الفايل اللي هكتب فيه سطور الكواليتي وهي في صوره كراكتر (الفايل الوسيط)
    FILE *fpWrite=fopen("ID.txt","w");  
	//بتأكد لو الفايل مش بيفتح فهترجع 0 وهخليه يطبعلي الرساله دي للتاكيد
	if (!fpRead) {
		printf("Unable to open/detect file");
		return;
	}
    if (!fpWrite) {
		printf("Unable to open/detect file");
		return;
	}

// دي جزئية القرايه من الفايل حيث عملت متغير تشيك واديته قيمه 1 يعني هيبدا باول سطر في الفاست كيو 
	int check = 0;
	// بفرر ده ارراي من الكراكتر هخزن فيه سطر سطر من اللي هقراهم واديته حجم ب 100 باعتبار ان مفيش سطر فيهم زاد عن كده في الحجم 
	char buf[10000];

	//بتلف اللوب دي على فايل الفاست كيو سطر سطر 
	while (fgets(buf, 10000, fpRead)) {
    // بتأكد لو السطر كان السطر بتاع الكواليتي هيكتبه في الفايل الوسيط 
		if ((check % 4==0))
		{
			   
				fputs(buf,fpWrite);
			
			
		}
		 check +=1;
	}
    // لازم في الاخر اقفل الفايلات اللي فتحتها
	fclose(fpRead);
    fclose(fpWrite);  
	return;
}
void QualityInInteger()
{
	// وظيفة الفنكشن دي تفتح الفايل الوسيط وتمشي على سطر سطر وحرف حرف وتحوله للقيمه الرقميه للكواليتي

	// بفتح الفايل الوسيط عشان اقرأ منه سطور الكواليتي وهي في صورة كراكتر
    FILE* fpRead = fopen("QualityChar.txt", "r");
	// بفتح الفيل اللي هكتب فيه قيم الكواليتي وهي رقميه 
    FILE *fpWrite=fopen("QualityInteger.txt","w");  

	// بتاكد من ان الفايلات هتفتح بدون مشاكل
    if (!fpRead) {
		printf("Unable to open/detect file");
		return;
	}
    if (!fpWrite) {
		printf("Unable to open/detect file");
		return;
	}

	// عملت متغير نوعه كراكتر عشان يساعدني في تحولي كل كراكتر للاسكي كود المقابل له
    char buf ;  
	//هلوب على الفايل حرف حرف لحد ما اوصل لنهايته 
    while ((buf = fgetc(fpRead)) != EOF)
    {
		//بتاكد لو مكنش الحرف اللي بقرأه ده هو اللي بنزلني لسطر عشان اعلم الفايل سطر سطر 
		if(buf == '\n'){
			// كده انا بنزل سطر جوه الفايل
			fprintf(fpWrite,"\n");
		}
		else
		{
			//هنا بتم عملية تحويل الكراكتر الى الرقم المقابل له وبطرح 33 عشان اسكيب اول 33 خانه فاضيه في جدول الاسكي
			int asscii = buf-33;
			// بكتب في الفايل بتاع الكتابه القيم الرقميه للكواليتي
			fprintf(fpWrite, "%d", asscii);
			// بسيب مسافه بعد كل رقم عشان اعرف احولهم لداتا فريم في الار لما اقراهم كجدول
			fprintf(fpWrite, " ");
		}        
    }
	// لازم اقفل الفايلات اللي فتحتها 
    fclose(fpRead);
    fclose(fpWrite);  
	return;
}

int main()
{	
	IDs();
	Reads();
	QualityInChar();
    QualityInInteger();
	return 0;
}
